{
  "allProjects": {
    "15720": {
      "title": "Gemma M0 Goal Tracker",
      "teaser":  "In this project you will program a Gemma M0 to respond to pressure input and sew the circuit into your clothes!",
      "id": 15720
    },
    "4781": {
      "title": "What is Scratch?",
      "teaser":  "Investigate several different types of games to see what’s possible when creating a game in Scratch. Then look under the hood and try to match code blocks with game mechanics.",
      "id": 4781
    },
    "10455": {
      "title": "Build a House with SketchUp",
      "teaser":  "Sharpen your knowledge of 3D design by learning to use Trimble’s SketchUp software.",
      "id": 10455
    },
    "2418": {
      "title": "Learning Linux",
      "teaser":  "Install and explore the popular Linux operating system, Ubuntu and compare its features to other operating systems that you know.",
      "id": 2418
    },
    "11039": {
      "title": "Sewable Superhero Cuff",
      "teaser":  "Sew a wristband that gives you the power to test the conductivity of your world.",
      "id": 11039
    },
    "7023": {
      "title": "Creative Commons .GIF Exchange",
      "teaser":  "Make an animated GIF and decide how you want to share it using Creative Commons licenses.",
      "id": 7023
    },
    "6477": {
      "title": "Core Mechanics",
      "teaser":  "Play games to get good at identifying game mechanics. Then, remix popular games to create new combinations of mechanics that change the experience.",
      "id": 6477
    },
    "2438": {
      "title": "Paper ToS",
      "teaser":  "Tossing away your right to privacy when joining the newest online phenomenon is easier than you might think! Learn about what rights you may be giving away when you click ‘Agree’.",
      "id": 2438
    },
    "12707": {
      "title": "8-Bit Pixel Artist",
      "teaser": "Use Piskel to create a GIF in the 8-Bit art style",
      "id": 12707
    },
    "14677": {
      "title": "Earthling Music",
      "teaser":  "Make a song in Soundation that represents what life is like on Earth!",
      "id": 14677
    },
    "4201": {
      "title": "Light Dimmers & Intelligent Sensors",
      "teaser":  "Control the resistance of an LED circuit with a dimmer (potentiometer) and a light sensor (photoresistor), seeing first hand how Ohm’s Law works.",
      "id": 4201
    },
    "2289": {
      "title": "The Do It Yourself Project",
      "teaser":  "Create a step by step guide for a problem that you have fixed so that someone else could fix it too.",
      "id": 2289
    },
    "11787": {
      "title": "Curating Your Work",
      "teaser":  "Choose work for a project portfolio that best tell the story you want your audience to hear.",
      "id": 11787
    },
    "4380": {
      "title": "Intro to the Arduino",
      "teaser":  "Create and program a digital blinking LED light circuit with the Arduino Microcontroller.",
      "id": 4380
    },
    "9802": {
      "title": "Educators: Awarding Badges",
      "teaser":  "Find out more about Mouse’s Digital Badges and how you can award them.",
      "id": 9802
    },
    "10935": {
      "title": "Sew a Basic Circuit",
      "teaser":  "Take your first shot at making a circuit with sewable materials and learn a little about how circuits work along the way.",
      "id": 10935
    },
    "7494": {
      "title": "Designing Layout",
      "teaser":  "Discover how the placement of design elements can make a big difference to the message.",
      "id": 7494
    },
    "2904": {
      "title": "Hardware Everywhere",
      "teaser":  "Get your hands on computer guts to find out what makes the machine work.",
      "id": 2904
    },
    "16590": {
      "title": "Take Your Shot",
      "teaser":  "Learn basic shot and composition techniques so you can create images that illustrate a feeling and document the stories around you.",
      "id": 16590
    },
    "10645": {
      "title": "Design a Keychain with SketchUp",
      "teaser":  "Sharpen your knowledge of 3D design by learning to use Trimble’s SketchUp Make Software.",
      "id": 10645
    },
    "5558": {
      "title": "Found Object Game",
      "teaser":  "Test your Game Making skills! Design your own Found Object Game with unique goals, mechanics and more.",
      "id": 5558
    },
    "7256": {
      "title": "Design Observation",
      "teaser":  "Spot opportunities for design everywhere you look by sharpening your observation skills!",
      "id": 7256
    },
    "16219": {
      "title": "DIY Operation",
      "teaser":  "Create your own version of the game Operation with easy to find materials!",
      "id": 16219
    },
    "3500": {
      "title": "Scratch Serious Game",
      "teaser":  "Remix a Scratch game into a serious game about a topic of your choice. Pick a topic, research it, design a game concept and execute it using Scratch.",
      "id": 3500
    },
    "3782": {
      "title": "Network Design Challenge",
      "teaser":  "Connect the dots between routers, switches, laptops and other random devices to design a fully connected network!",
      "id": 3782
    },
    "11320": {
      "title": "Fabric Push Button",
      "teaser":  "Build your own push button out of conductive fabric for a fun, squishy way to control your circuit.",
      "id": 11320
    },
    "9663": {
      "title": "Haunted House Music",
      "teaser": "Let’s make some great music to celebrate halloween this season!",
      "id": 9663
    },
    "9266": {
      "title": "Educators: All about Mouse Create",
      "teaser":  "Are you an educator getting started on Mouse Create? Learn how to use Mouse Projects and tools here.",
      "id": 9266
    },
    "17547": {
      "title": "How to Use a Multimeter",
      "teaser":  "Learn how to use this essential tool to measure electricity, test batteries and check for continuity in a circuit.",
      "id": 17547
    },
    "2768": {
      "title": "The Serious Gamer",
      "teaser":  "Explore several serious games. Through play, you will analyze how serious global, political, and social issues are embedded into gameplay.",
      "id": 2768
    },
    "6070": {
      "title": "Design a Better World",
      "teaser":  "Make hundreds of sandwiches in 30 mins with lots of ridiculous rules to make it fun. This project connects design to its most critical purpose & brings teams together.",
      "id": 6070
    },
    "16304": {
      "title": "Pixel Mosaic",
      "teaser": "Create a pixel art representation of your goals for the year.",
      "id": 16304
    },
    "8879": {
      "title": "Drawing in 3D",
      "teaser":  "Take your designs to the next level by transforming them in 3D! Learn the basics in this activity.",
      "id": 8879
    },
    "11874": {
      "title": "UX/UI Design",
      "teaser":  "Design with understanding of how User Experience (UX) and User Interface (UI) create user-friendly and attractive websites.",
      "id": 11874
    },
    "7697": {
      "title": "HTML & CSS Relay",
      "teaser":  "Compete in teams to be the first to finish remixing the content, HTML code and CSS styles of a webpage on Thimble.",
      "id": 7697
    },
    "9479": {
      "title": "Model Something Real in CAD",
      "teaser":  "Level-up your CAD software skills by modeling real-world objects in the digital realm.",
      "id": 9479
    },
    "6991": {
      "title": "Empathy & Assistive Tech",
      "teaser":  "​Experience through simulations how empathy makes it possible to design things for other people, including people with disabilities.​",
      "id": 6991
    },
    "9149": {
      "title": "Moving to the CAD World",
      "teaser":  "Enter a whole new dimension by turning flat 2D shapes into digital 3D objects!",
      "id": 9149
    },
    "5046": {
      "title": "Design your own Digital Circuit",
      "teaser":  "​Design an original Arduino circuit, with a blueprint and parts list.",
      "id": 5046
    },
    "17298": {
      "title": "Jingle Jam",
      "teaser": "Use Google Song Maker to make your own original song.",
      "id": 17298
    },
    "8219": {
      "title": "Design Story",
      "teaser":  "Engage audiences by telling a strong design story featuring great documentation.",
      "id": 8219
    },
    "7841": {
      "title": "Playtesting",
      "teaser":  "Design a quick ‘race-to-the-end’ game with a friend while you build the key design skill of playtesting.",
      "id": 7841
    },
    "12188": {
      "title": "Telling the Story of Your Success",
      "teaser":  "Develop skills and habits that make documenting and demonstrating work part of the creative process.",
      "id": 12188
    },
    "14468": {
      "title": "Physical Computing with Raspberry Pi",
      "teaser":  "Create and program a digital blinking LED light circuit with the Raspberry Pi.",
      "id": 14468
    },
    "11208": {
      "title": "RGB Color Mixer",
      "teaser":  "Sew a color changeable circuit and create a light show in for your friends!",
      "id": 11208
    },
    "237": {
      "title": "Become Action Heroes",
      "teaser":  "Bring your energy-saving ideas to life with a plan to lower your site’s carbon footprint.",
      "id": 237
    },
    "2499": {
      "title": "Password Round Robin",
      "teaser":  "Play a game to defend yourself against bots and identity thieves by creating an uncrackable password!",
      "id": 2499
    },
    "260": {
      "title": "Pitch It!",
      "teaser": "Present your ideas to help bring green changes to your community.",
      "id": 260
    },
    "8263": {
      "title": "Pick a Palette",
      "teaser":  "Learn how to pick good color schemes that all audiences can appreciate, and how to change color schemes on websites in this follow-up to the Meet the Color Wheel activity.",
      "id": 8263
    },
    "15826": {
      "title": "Restart Party",
      "teaser":  "Flex your fix-it skills at a fun, drop-in event where you and community members fix or upgrade electronics together.",
      "id": 15826
    },
    "5548": {
      "title": "Talk like a Fixer",
      "teaser":  "Talk like a pro when you help other people work through technical problems. Practice asking the right questions and identifying another person’s level of experience.",
      "id": 5548
    },
    "15484": {
      "title": "Intro to Gemma M0",
      "teaser":  "Learn about the Gemma M0: a small sewable microcontroller board, that will allow you to code behavior into your wearable projects!",
      "id": 15484
    },
    "8289": {
      "title": "Rules of Brainstorming",
      "teaser":  "Practice the professional process of brainstorming once your research and problem identification are complete.",
      "id": 8289
    },
    "5000": {
      "title": "Build your own Digital Circuit",
      "teaser":  "Turn an original idea into a real digital circuit prototype by building and testing and improving over several iterations.",
      "id": 5000
    },
    "2451": {
      "title": "The Internet is a Live Mic",
      "teaser":  "Explore the legacy you leave online by examining what your digital activity says about you.",
      "id": 2451
    },
    "7058": {
      "title": "Interviewer Strategies",
      "teaser":  "Practice interview techniques to learn how designers identify their users’ needs.",
      "id": 7058
    },
    "7382": {
      "title": "Hello World",
      "teaser":  "Write code in many different languages, find out what makes one programming language different from another.",
      "id": 7382
    },
    "5267": {
      "title": "Software 101",
      "teaser":  "Explore the basics of computer programs like file extensions, installation and uninstallation.",
      "id": 5267
    },
    "1935": {
      "title": "Hack the News",
      "teaser":  "Hack the code on the homepage of your favorite news site to tell a fun or thought-provoking story.",
      "id": 1935
    },
    "2508": {
      "title": "Help Desk Superhero",
      "teaser":  "Put a ticket tracking system to the test by writing Hollywood-inspired help desk tickets.",
      "id": 2508
    },
    "6144": {
      "title": "Kraken the Code",
      "teaser":  "Hone your inner Truth Detective by learning how to tell the difference between legitimate information online and stuff that’s unreliable.",
      "id": 6144
    },
    "6210": {
      "title": "Intro to Game Design",
      "teaser":  "Discover what games are made of, what a Game Designer is and hack a game.",
      "id": 6210
    },
    "6343": {
      "title": "I is for Input",
      "teaser":  "Reflect on all ways that computers accept our input beyond keyboards and mice, then invent your own device that lets you communicate in an all new way.",
      "id": 6343
    },
    "3996": {
      "title": "Building with a Breadboard",
      "teaser":  "Build a circuit that lights up with the push of a button while learning how to use a breadboard.",
      "id": 3996
    },
    "7629": {
      "title": "Interviewing Target Users",
      "teaser":  "Lead interviews with users, taking observations and notes to find unique design opportunities.",
      "id": 7629
    },
    "5194": {
      "title": "PSA: Be Professional",
      "teaser":  "Create a PSA (Public Service Announcement) that demonstrates the do’s and don’ts of professional etiquette.",
      "id": 5194
    },
    "2458": {
      "title": "Malware Avengers",
      "teaser":  "Fight malicious computer villains with malware-fighting super powers!",
      "id": 2458
    },
    "17075": {
      "title": "Make a Movie Trailer",
      "teaser":  "Use what you know about shots, storyboarding, sound recording, and editing, to create your own film trailer.",
      "id": 17075
    },
    "11473": {
      "title": "DIY Bend Sensor",
      "teaser":  "Control circuits with a bendable made of fabric and flexible conductive materials.",
      "id": 11473
    },
    "5786": {
      "title": "Build a Mobile App with App Inventor",
      "teaser": "Code and test mobile apps in MIT’s App Inventor 2!",
      "id": 5786
    },
    "8088": {
      "title": "Paper Prototyping",
      "teaser":  "Experiment with paper prototyping by reverse-engineering everyday objects to get a glimpse into how they were designed.",
      "id": 8088
    },
    "7180": {
      "title": "User Personas",
      "teaser":  "Create a detailed profile called a User Persona to help you come up with ideas that address a group’s needs, life experience and motivations.",
      "id": 7180
    },
    "8757": {
      "title": "*Mouse Create Scavenger Hunt*",
      "teaser":  "ATTN NEW MEMBERS: Get to know the projects and features on Mouse Create with a quick scavenger hunt challenge.",
      "id": 8757
    },
    "6507": {
      "title": "Awkward! Dealing with Strangers Online",
      "teaser":  "Keeping online interactions positive and safe is important for everyone. Identify opportunities to connect with new people and filter out the shady characters.",
      "id": 6507
    },
    "6269": {
      "title": "People Programming",
      "teaser":  "Searching for information on the web is easy, but could you write down every step you take along the way? Challenge yourself to do some “people programming” and find out.",
      "id": 6269
    },
    "8738": {
      "title": "Basic Elements of 3D Shapes",
      "teaser":  "Learn what 3D designers think about when designing things for real-life, game worlds or animation!",
      "id": 8738
    },
    "2017": {
      "title": "Source Whisperer",
      "teaser": "Draw a website by hand by looking at the HTML source code.",
      "id": 2017
    },
    "195": {
      "title": "Energy Sleuths",
      "teaser":  "Measure electricity usage and run experiments using the Green Tech Lab App to figure out ways to lower your carbon footprint!",
      "id": 195
    },
    "1815": {
      "title": "Hardware Go Fish",
      "teaser":  "Learn what it takes to design your dream computer, whether you are a gamer, a designer or a student on the go, in this competitive card game!",
      "id": 1815
    },
    "3220": {
      "title": "Social Network Sort",
      "teaser":  "Make good choices about posting to social media sites. Consider what is appropriate, and manage settings to protect your privacy.",
      "id": 3220
    },
    "5554": {
      "title": "Teamwork: The Mill Game",
      "teaser":  "Get to know your team while completing this series of fun and increasingly elaborate challenges!",
      "id": 5554
    },
    "2348": {
      "title": "Tag Tag Revolution",
      "teaser": "Learn about HTML tags and markup, dance party-style.",
      "id": 2348
    },
    "8317": {
      "title": "Framing Questions",
      "teaser":  "Learn how to frame your design challenges with How Might We Questions in order to achieve the most from brainstorms.",
      "id": 8317
    },
    "7864": {
      "title": "JavaScript Generator",
      "teaser":  "Remix JavaScript code using Thimble to make and share a randomized words generator.",
      "id": 7864
    },
    "12934": {
      "title": "Alternate Reality",
      "teaser":  "Code a choose-your-own-adventure story with Mozilla Thimble and Javascript.",
      "id": 12934
    },
    "5667": {
      "title": "Design a Mobile App",
      "teaser":  "Explore how mobile apps are designed with the sensors and hardware that give them special powers, critique your favorite apps and then design one of your own!",
      "id": 5667
    },
    "2218": {
      "title": "OS for All",
      "teaser":  "Configure operating systems to give all users equal access. Explore different abilities & the adjustments in desktop & mobile devices.",
      "id": 2218
    },
    "3714": {
      "title": "JavaScript Takeover",
      "teaser":  "Transform the web with your own pictures by remixing a JavaScript bookmarklet using Mozilla Thimble.",
      "id": 3714
    },
    "6858": {
      "title": "Ad Battle",
      "teaser":  "Play a game to learn how ads appear on websites, and how they track our web behavior.",
      "id": 6858
    },
    "13335": {
      "title": "Unity Lander 2",
      "teaser":  "Create a fun physics-based game using Unity. No coding required, the final project of the Unity Lander series!",
      "id": 13335
    },
    "4114": {
      "title": "Setting Up a Ticket Tracking System",
      "teaser":  "Set up your own ticket tracking system and implement it for your group’s help desk.",
      "id": 4114
    },
    "4920": {
      "title": "LED Light Chaser",
      "teaser":  "Program an Arduino microcontroller to make an LED light show and edit the code to come up with your own light designs.",
      "id": 4920
    },
    "5509": {
      "title": "It’s the Remix",
      "teaser":  "Find a fun Scratch game, and make it your own by creating a remix! Design your own characters, and background, and level up the challenge in your new version.",
      "id": 5509
    },
    "3917": {
      "title": "Once Upon a Google Doc",
      "teaser":  "Write a crazy team story and then edit it together at the same time using Google Docs.",
      "id": 3917
    },
    "249": {
      "title": "Launch a Green Media Campaign",
      "teaser":  "Create original media for a campaign about saving energy in your community.",
      "id": 249
    },
    "44": {
      "title": "DIY Generator",
      "teaser":  "Create an electric current with just a wire coil and a magnet. In this project, you’ll light a human-powered LED!",
      "id": 44
    },
    "8540": {
      "title": "Typography: Designing Fonts",
      "teaser":  "Design your own font and find out why they’re so important to design!",
      "id": 8540
    },
    "16895": {
      "title": "Making Meaning with Images",
      "teaser":  "View and interpret how visual texts are structured to communicate meaning and emotion.",
      "id": 16895
    },
    "3099": {
      "title": "Grow-A-Game",
      "teaser":  "Use Grow-A-Game to help develop ideas and practice applying your skills as a designer to serious issues..",
      "id": 3099
    },
    "1874": {
      "title": "Design is Everywhere",
      "teaser":  "Explore the world through the eyes of a designer. Learn the fundamentals of design, and make choices about what makes design more or less successful.",
      "id": 1874
    },
    "13263": {
      "title": "Unity Lander 1",
      "teaser":  "Get started with Unity, professional game development software. Play a Moon Lander game and create your own unique level for it.",
      "id": 13263
    },
    "7769": {
      "title": "Aspirational Avatar",
      "teaser":  "Create an avatar for your profile that that represents the person you want to be in a year!",
      "id": 7769
    },
    "2477": {
      "title": "Phish Market",
      "teaser":  "Learn to identify and avoid digital phishing attacks by making up your own and attempting to fool other participants into thinking they’re real.",
      "id": 2477
    },
    "11078": {
      "title": "Sew a Tech Case",
      "teaser":  "Get familiar with sewing terms, supplies, and techniques while making a handy tech-storage case for yourself.",
      "id": 11078
    },
    "11939": {
      "title": "Information Architecture",
      "teaser":  "Use information architecture to make finding, uploading and sharing your stuff fast and simple.",
      "id": 11939
    },
    "5293": {
      "title": "Games from Scratch",
      "teaser":  "Program a simple game in Scratch starting from a blank screen with Scratch code blocks.",
      "id": 5293
    },
    "4747": {
      "title": "Reverse Engineering",
      "teaser":  "Break things with confidence! Learn the essential steps of reverse-engineering by deconstructing and documenting the inner-workings of everyday objects.",
      "id": 4747
    },
    "15247": {
      "title": "Raspberry Pi Sound Machine",
      "teaser":  "Build and code a music-playing circuit with a Raspberry Pi, then remix the code to turn it into an alarm system.",
      "id": 15247
    },
    "4254": {
      "title": "Goals, Obstacles & Chance",
      "teaser":  "Explore the importance of goals, obstacles, and chance in designing games. Through game play and design see how these elements make a game more or less challenging, engaging and fun",
      "id": 4254
    },
    "3018": {
      "title": "Ping Kong",
      "teaser":  "Pretend to be data packets traveling from a computer to the internet in a fun obstacle course. Then, use ping and tracert in the command line.",
      "id": 3018
    },
    "8104": {
      "title": "Meet the Color Wheel",
      "teaser":  "Start learning about color and how designers use it to attract audiences.",
      "id": 8104
    },
    "16730": {
      "title": "Drawing a Great Story",
      "teaser":  "Plan and prepare a story with structure then turn it into a storyboard to bring it to life!",
      "id": 16730
    },
    "11238": {
      "title": "Sew an LED Snap Circuit",
      "teaser":  "Embed an interactive circuit into your tech case that turns on and off with the snap of a button.",
      "id": 11238
    },
    "13798": {
      "title": "Code a Card",
      "teaser": "Code a virtual greeting card in Scratch!",
      "id": 13798
    },
    "7968": {
      "title": "Synthesizing Interviews",
      "teaser":  "Organize your interview notes to find themes that will help you brainstorm great ideas!",
      "id": 7968
    },
    "17703": {
      "title": "*BrainPOP Creative Coding Microproject",
      "teaser":  "Use BrainPOP’s Creative Coding with Vidcode to design a comic or a meme.",
      "id": 17703
    },
    "11846": {
      "title": "What is a Portfolio?",
      "teaser":  "Learn how you can show off all the different, amazing things you’ve accomplished in this introduction to digital portfolios.",
      "id": 11846
    },
    "5745": {
      "title": "OS Design",
      "teaser":  "Dive quickly into the roots of modern operating systems by comparing common features. Then mock up the home screen of your own system using simple prototyping tools.",
      "id": 5745
    },
    "10218": {
      "title": "MouseBot GIF",
      "teaser": "Create an animated GIF story using our MouseBot characters!",
      "id": 10218
    },
    "155": {
      "title": "Solarize It!",
      "teaser": "Green your gadgets with solar panels.",
      "id": 155
    },
    "3263": {
      "title": "Secret Sculpture: Practicing Communication",
      "teaser": "Boost your communication skills with a team sculpture challenge.",
      "id": 3263
    },
    "15326": {
      "title": "Raspberry Pi Nightlight",
      "teaser":  "Build a digital nightlight with a Raspberry Pi and write a program that reads and processes light data from an analog photoresistor.",
      "id": 15326
    },
    "8971": {
      "title": "You’ve Got the Power",
      "teaser":  "Master the power of power! Get to know how we make electricity and how it gets to our communities.",
      "id": 8971
    },
    "16812": {
      "title": "Getting Good Sound",
      "teaser":  "Learn how to choose an appropriate setting for audio recording with your phone or computer.",
      "id": 16812
    },
    "6859": {
      "title": "Arduino Nightlight",
      "teaser":  "Build a digital nightlight with an Arduino and write a program that reads and processes light data from an analog photoresistor.",
      "id": 6859
    },
    "15456": {
      "title": "Raspberry Pi LED Light Chaser",
      "teaser":  "Program a Raspberry Pi to make an LED light show and edit the code to come up with your own light designs.",
      "id": 15456
    },
    "10102": {
      "title": "Epic Font",
      "teaser": "Your challenge is to make an original epic font!",
      "id": 10102
    },
    "3142": {
      "title": "Ports & Connections",
      "teaser":  "Learn what all those cables that came with your laptop are for and how to connect them.",
      "id": 3142
    },
    "1769": {
      "title": "The Leadership Wheel",
      "teaser":  "Rethink your ideas about what makes a good leader and discover your own leadership style.",
      "id": 1769
    },
    "9842": {
      "title": "Educators: Planning the Year",
      "teaser":  "Customize your plan for the year by thinking about your site, learners, and resources!",
      "id": 9842
    },
    "10333": {
      "title": "Write the Future",
      "teaser":  "Learn to use inkewriter to create a digital Choose Your Own Adventure-style game while thinking about how Earth supports life.",
      "id": 10333
    },
    "4397": {
      "title": "Transistor Nightlight",
      "teaser":  "Make a circuit with a transistor that turns an LED light on when it is dark.",
      "id": 4397
    },
    "105": {
      "title": "Testing Turbines",
      "teaser":  "Design and build your own mini turbine out of everyday classroom materials.",
      "id": 105
    },
    "2093": {
      "title": "Light-up Creature",
      "teaser":  "Create an LED light-up creature to learn how simple circuits work.",
      "id": 2093
    },
    "4586": {
      "title": "JavaScript Chatbot",
      "teaser":  "Have you ever wondered how robots are programmed to talk? Here’s a chance to try it out, with this simple Thimble Chatbot!",
      "id": 4586
    },
    "2488": {
      "title": "The Human Circuit",
      "teaser":  "Discover how electricity flows in a circuit using your own body’s conductivity.",
      "id": 2488
    },
    "5158": {
      "title": "Say Yes to the IP Address",
      "teaser":  "Create a map that shows how data travels between you and your favorite website, exploring network addressing, TCP/IP and DNS along the way.",
      "id": 5158
    },
    "14082": {
      "title": "3D Space Model",
      "teaser": "Build a 3D model in TinkerCad that you’d like shot into space!",
      "id": 14082
    },
    "134": {
      "title": "Hacking for a Sustainable Future",
      "teaser":  "Hack an HTML story with your knowledge of renewable energy to save a city from disaster.",
      "id": 134
    },
    "5573": {
      "title": "Human-Centered Design",
      "teaser":  "Discover how professional design teams come up with innovative ideas that are inspired by real people with real needs.",
      "id": 5573
    },
    "6813": {
      "title": "Design in a Bag",
      "teaser":  "Turn a design challenge and bag of random items into a rapid prototype.",
      "id": 6813
    },
    "5996": {
      "title": "Make a Simple Website with Thimble",
      "teaser":  "Make a simple and publish a simple website with Mozilla’s Thimble tool.",
      "id": 5996
    },
    "18820": {
      "title": "Make a Simple Website with Glitch",
      "teaser":  "Make and publish a simple website using Glitch.",
      "id": 18820
    },
    "11680": {
      "title": "LilyPad Goal Tracker",
      "teaser":  "In this project you will program a LilyPad to respond to pressure input and sew the circuit into your clothes!",
      "id": 11680
    },
    "12118": {
      "title": "Bringing Your Portfolio to Life",
      "teaser":  "Apply project documentation skills and knowledge by completing a first version of a completed digital portfolio.",
      "id": 12118
    },
    "9914": {
      "title": "Animate Your Name",
      "teaser": "Animate your name using Scratch to create interactive artwork!",
      "id": 9914
    },
    "11772": {
      "title": "A.I. Avatar",
      "teaser":  "Use Auto Draw to create an avatar that represents your technology goals for the year.",
      "id": 11772
    },
    "3855": {
      "title": "My Name is URL",
      "teaser":  "Discover what happens behind the curtain when you type www.something.com into your web browser.",
      "id": 3855
    },
    "6021": {
      "title": "Arduino Sound Machine",
      "teaser": "Build and code a music-playing circuit with an Arduino.",
      "id": 6021
    },
    "2150": {
      "title": "Text Your Computer: Use the Command Line",
      "teaser":  "Use the command line interface to do basic tasks like creating or editing text files.",
      "id": 2150
    },
    "3443": {
      "title": "Internet of Things",
      "teaser":  "Unleash your inner inventor by reimagining any object in the room as a “smart device.”",
      "id": 3443
    },
    "3537": {
      "title": "The Mousemallow Challenge",
      "teaser": "Discover new definitions of failure and success while building a tower of marshmallows!",
      "id": 3537
    },
    "11565": {
      "title": "Intro to the LilyPad Arduino USB",
      "teaser": "Use the LilyPad sewable microcontroller board to code behavior into your wearable tech projects!",
      "id": 11565
    },
    "7298": {
      "title": "Basic Elements of Graphic Design",
      "teaser": "Take the first step towards becoming a great graphic designer by learning the basics!",
      "id": 7298
    },
    "176": {
      "title": "Battery Builder",
      "teaser": "Build your own battery from common materials and see who can generate the most power!",
      "id": 176
    },
    "12465": {
      "title": "Haunted VR",
      "teaser": "Build a 3D haunted house in CoSpaces to view in 360° or full VR.",
      "id": 12465
    },
    "8569": {
      "title": "Iterations & Feedback",
      "teaser": "Create and document 3 increasingly technical iterations of a design prototype incorporating feedback from users.",
      "id": 8569
    },
    "18770": {
      "title": "Synthesis - Evolved Creatures",
      "teaser": "Brainstorm, design and build your final evolved creature prototype!",
      "id": 18770
    },
    "18797": {
      "title": "Synthesis - Future Humans",
      "teaser": "Learn to control servo motor speed and spin using with photoresistors and mechanical switches, and control multiple motors on one circuit.",
      "id": 18797
    },
    "21066": {
      "title": "Scripted Viral Media",
      "teaser": "Learn the essentials of viral media making and develop a style of scripted viral media for videos you will create later in this course.",
      "id": 21066
    },
    "21095": {
      "title": "Telling a True Story",
      "teaser": "Use what you know about storytelling to begin a project outline for your scripted viral video.",
      "id": 21095
    },
    "21124": {
      "title": "Capturing Raw Footage",
      "teaser": "Use what you know about viral media, shot lists, sound recording, and editing to create your own piece of media.",
      "id": 21124
    },
    "21153": {
      "title": "Editing Your Footage",
      "teaser": "Students will use editing platforms to combine and alter their footage to create a scripted viral video ready for sharing.",
      "id": 21153
    },
    "21182": {
      "title": "Uploading, Sharing and Promoting",
      "teaser": "Select a platform to share your scripted viral video for free. Determine how to best attract viewers.",
      "id": 21182
    },
    "21211": {
      "title": "Stop Motion Animator 1",
      "teaser": "Learn the essentials of animation and create a short stop motion video.",
      "id": 21211
    },
    "21240": {
      "title": "Stop Motion Animator 2",
      "teaser": "Learn both historical and current examples of stop-motion and claymation animations, then plan and create your own.",
      "id": 21240
    },
    "21269": {
      "title": "Digital Animator",
      "teaser": "Draw and design your own animation using Wick Editor.",
      "id": 21269
    },
    "21298": {
      "title": "Video Activism",
      "teaser": "Use what you know about filmmaking, viral media, and animation to create a video with a social purpose.",
      "id": 21298
    },
    "20478": {
      "title": "G4C Educator Handbook",
      "teaser": "Teachers, start here first! Prepare yourself to lead teams through the Games for Change Student Challenge and the Impact Game Design course with this project.",
      "id": 20478
    },
    "20483": {
      "title": "A New Challenger Has Arrived!",
      "teaser": "Discover how you can make and submit an impact game to the Games for Change Student Challenge for a chance to win prizes, recognition and a scholarship!",
      "id": 20483
    },
    "19083": {
      "title": "G4C - Intro to Game Design",
      "teaser": "Discover what games are made of, what a Game Designer is and hack a game.",
      "id": 19083
    },
    "19175": {
      "title": "G4C - Core Mechanics",
      "teaser": "Play games to get good at identifying game mechanics. Then, remix popular games to create new combinations of mechanics that change the experience.",
      "id": 19175
    },
    "20830": {
      "title": "G4C - Goals, Obstacles & Chance",
      "teaser": "Explore the importance of goals, obstacles, and chance in designing games. Through game play and design see how these elements make a game more or less challenging, engaging and fun.",
      "id": 20830
    },
    "19289": {
      "title": "G4C - Found Object Game",
      "teaser": "Test your Game Making skills! Design your own Found Object Game with unique goals, mechanics and more.",
      "id": 19289
    },
    "19446": {
      "title": "G4C - What is Scratch?",
      "teaser": "Investigate several different types of games to see what’s possible when creating a game in Scratch. Then look under the hood and try to match code blocks with game mechanics.",
      "id": 19446
    },
    "19543": {
      "title": "G4C - Games from Scratch",
      "teaser": "Program a simple game in Scratch starting from a blank screen with Scratch code blocks.",
      "id": 19543
    },
    "19693": {
      "title": "4C - It's the Remix",
      "teaser": "Find a fun Scratch game, and make it your own by creating a remix! Design your own characters, and background, and level up the challenge in your new version.",
      "id": 19693
    },
    "19337": {
      "title": "G4C - Impact Game Judge",
      "teaser": "Explore several impact games. Through play, you will analyze how important global, political, and social issues are embedded into gameplay.",
      "id": 19337
    },
    "19831": {
      "title": "G4C - Grow-A-Game",
      "teaser": "Level up to become a Impact Game Designer. Use Grow-A-Game to help develop ideas and practice applying your skills as a designer to important issues.",
      "id": 19831
    },
    "19890": {
      "title": "G4C - Scratch Impact Game",
      "teaser": "Remix a Scratch game into an impact game about a topic of your choice. Pick a topic, research it, design a game concept and execute it using Scratch.",
      "id": 19890
    },
    "20487": {
      "title": "G4C - Final Boss: Submitting Your Game",
      "teaser": "Submit an impact game to the G4C Student Challenge for a chance to win prizes like a $1,000 scholarship! This is the last project in the Impact Game Design course.",
      "id": 20487
    },
    "21983": {
      "title": "Invention X Nature Overview for Students: Evolved Creatures",
      "teaser": "Invention X Nature Overview for Students: Evolved Creatures",
      "id": 21983
    },
    "22324": {
      "title": "Prototyping Journal: Evolved Creatures",
      "teaser": "Make a journal with UV lights so that you can include doodles and thoughts privately using invisible ink.",
      "id": 22324
    },
    "18754": {
      "title": "Animatronics",
      "teaser": "Build imaginary creatures that move using servo motors, Arduino, and flexible cardboard joints!",
      "id": 18754
    },
    "18765": {
      "title": "Plants",
      "teaser": "Use an Arduino and servo motors to make imaginary “sensitive creatures” inspired by the way that plants move.",
      "id": 18765
    },
    "21664": {
      "title": "Cephalopods",
      "teaser": "Create a 3D, light-up creature with bendable limbs using foam, yarn and wire!",
      "id": 21664
    },
    "20928": {
      "title": "Coding 1: Intro to Arduino",
      "teaser": "Code an Arduino to interact with a servo motor.",
      "id": 20928
    },
    "20933": {
      "title": "Coding 2: Servos and Sensors",
      "teaser": "Code an Arduino to control servo motors and an infrared sensor",
      "id": 20933
    },
    "20938": {
      "title": "Coding 3: LED Patterns",
      "teaser": "Learn the coding concepts that will help you customize your creations in the Cephalopods Domain!",
      "id": 20938
    },
    "20943": {
      "title": "Coding 4: Pitch Follower, Sensitive Servo, and Synthesis",
      "teaser": "Learn to code piezo microphones and control servo speed using with photoresistors.",
      "id": 20943
    },
    "21987": {
      "title": "Invention X Nature Overview for Students: Future Humans",
      "teaser": "A walk-through of the 2019 STEM Summer in the City program for high schoolers.",
      "id": 21987
    },
    "21992": {
      "title": "Prototyping Journal: Future Humans",
      "teaser": "Make a journal with UV lights so that you can include doodles and thoughts privately using invisible ink.",
      "id": 21992
    },
    "18781": {
      "title": "Bionics",
      "teaser": "Use servo motors to make mechanical structures that move organically in response to your own body movements.",
      "id": 18781
    },
    "21744": {
      "title": "Chameleons",
      "teaser": "Create a colorful responsive wearable circuit for a future human.",
      "id": 21744
    },
    "18787": {
      "title": "Bees",
      "teaser": "Build an interactive sound-systems that give Future Humans information about movement or interactions in their surroundings.",
      "id": 18787
    },
    "24295": {
      "title": "10 Blocks",
      "teaser": "Create a program using only 10 blocks. Use them once, twice, or multiple times, but use each block at least once.",
      "id": 24295
    },
    "24473": {
      "title": "About Me",
      "teaser": "Create an interactive Scratch project that helps other people learn more about YOU and the ideas, activities, and people that you care about.",
      "id": 24473
    },
    "24818": {
      "title": "Build a Band",
      "teaser": "Build your own music-inspired Scratch project by pairing sprites with sounds to design interactive instruments.",
      "id": 24818
    },
    "25137": {
      "title": "Cloning",
      "teaser": "Create multiple versions of the same sprite using the Scratch cloning feature",
      "id": 25137
    },
    "25079": {
      "title": "Creature Construction",
      "teaser": "Create a drawn creature divided into three parts with two friends.",
      "id": 25079
    },
    "24444": {
      "title": "Debug It 1",
      "teaser": "Put your Scratch skills to the test by debugging broken programs.",
      "id": 24444
    },
    "24905": {
      "title": "Debug It 2",
      "teaser": "Debug programs with animations in Scratch",
      "id": 24905
    },
    "25050": {
      "title": "Debug It 3",
      "teaser": "Put your Scratch skills to the test by debugging broken programs.",
      "id": 25050
    },
    "24876": {
      "title": "It's Alive",
      "teaser": "Explore ways of bringing sprites, images, and ideas to life as an animation by programming a series of costume changes.",
      "id": 24876
    },
    "24963": {
      "title": "Make a Block",
      "teaser": "Experiment with creating functions using the Make a Block Feature in Scratch",
      "id": 24963
    },
    "25195": {
      "title": "My Debug It",
      "teaser": "Create your own Debug It challenge for others to investigate, solve, and remix.",
      "id": 25195
    },
    "24847": {
      "title": "Orange Square, Purple Circle",
      "teaser": "Create a program that includes an orange square and a purple circle. What will you create?",
      "id": 24847
    },
    "25108": {
      "title": "Pass It On",
      "teaser": "You will start developing an animated story program, and then you will pass the story on to others to remix, extend, or reimagine!",
      "id": 25108
    },
    "24789": {
      "title": "Performing Script",
      "teaser": "Play the part of a sprite by acting out different Scratch blocks and scripts.",
      "id": 24789
    },
    "21037": {
      "title": "Programmed to Dance",
      "teaser": "This active and social project will introduce you to “Sequencing” while you dance in real life!",
      "id": 21037
    },
    "25166": {
      "title": "Scratch Advanced Concepts",
      "teaser": "Hidden in the extension area, these blocks will add new ways to interact with Scratch",
      "id": 25166
    },
    "24992": {
      "title": "Scratch Conversation",
      "teaser": "Use timing and broadcast blocks to explore different ways to program sprites to have conversations!",
      "id": 24992
    },
    "24235": {
      "title": "Scratch Creative Computing: Educator Handbook",
      "teaser": "[Educators Only] Teachers, start here! Prepare yourself to lead your students through the process of creative computing through this course",
      "id": 24235
    },
    "24934": {
      "title": "Scratch Music Video",
      "teaser": "Combine animation with music to create your own music video in Scratch",
      "id": 24934
    },
    "25021": {
      "title": "Scratch Scenes",
      "teaser": "Create a program that experiments with backdrops, like a story with multiple scenes or a slideshow",
      "id": 25021
    },
    "24265": {
      "title": "Scratch Surprise",
      "teaser": "Welcome to Scratch Creative Computing! In this project, learners will make their first program in Scratch, register an account and make their first journal entry.",
      "id": 24265
    },
    "24415": {
      "title": "Step By Step",
      "teaser": "Follow step-by-step tutorials to learn new skills in Scratch.",
      "id": 24415
    },
    "25476": {
      "title": "*Holiday Microproject: Scratch #CSforGood Impact Game",
      "teaser": "Turn a Scratch Game into a game that brings attention to an issue you are passionate about.",
      "id": 25476
    },
    "18582": {
      "title": "Wild Digital Pet",
      "teaser": "Code a digital pet in Scratch!",
      "id": 18582
    },
    "26322": {
      "title": "Intro to Scratch Game Design",
      "teaser": "Discover what games are made of, what a Game Designer is and hack a game.",
      "id": 26322
    },
    "26351": {
      "title": "Scratch Scoreboards",
      "teaser": "Remix a fish catching game by adding a variable to keep score.",
      "id": 26351
    },
    "26380": {
      "title": "Win Condition",
      "teaser": "Complete a Scratch game that never ends by giving it a win condition so that a player can win.",
      "id": 26380
    },
    "26409": {
      "title": "Remixing Games",
      "teaser": "Remix three starter games to complete three challenges.",
      "id": 26409
    },
    "26438": {
      "title": "Scratch Puzzles",
      "teaser": "Create a Scratch program for each of the nine interactive puzzles.",
      "id": 26438
    },
    "26467": {
      "title": "Debug it 4",
      "teaser": "Put your Scratch skills to the test by debugging broken programs.",
      "id": 26467
    },
    "24386": {
      "title": "My Scratch Impact Game",
      "teaser": "Create your own original impact game in Scratch!",
      "id": 24386
    }
  },
  "optionalProjects": [15720, 15484, 14468, 15247, 15326, 15456]
}
